In [1]:
#GroupBy 
# In this notebook we are going to see the simple aggregation of data

In [2]:
#import the required libraries

import pandas as pd
import numpy as np

In [3]:
#Sample DataFrame

data = {'key':['A', 'B', 'C', 'A', 'B', 'C', 'A', 'B', 'C'],
       'value':[0,5,10,5,10,15,10,15,20]}

df= pd.DataFrame(data)

df

  key  value
0   A      0
1   B      5
2   C     10
3   A      5
4   B     10
5   C     15
6   A     10
7   B     15
8   C     20

In [6]:
df.groupby('key').mean()

     value
key
A        5
B       10
C       15

In [8]:
#Load some data

newdf = pd.read_csv('http://bit.ly/wkspdata')

newdf.head()

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [9]:
#I want to see the average age for each sex

newdf.groupby('sex')['age'].mean()

sex
female    27.915709
male      30.726645
Name: age, dtype: float64

In [10]:
#calculate the total fare by sex

newdf.groupby('sex')['fare'].sum()

sex
female    13966.6628
male      14727.2865
Name: fare, dtype: float64

In [11]:
#calculate the average age by embarkation
newdf.groupby('embarked')['age'].mean()

embarked
C    30.814769
Q    28.089286
S    29.445397
Name: age, dtype: float64

In [12]:
#calculate the average age by embarked and further by sex

newdf.groupby(['embarked', 'sex'])['age'].mean()

embarked  sex
C         female    28.344262
          male      32.998841
Q         female    24.291667
          male      30.937500
S         female    27.771505
          male      30.291440
Name: age, dtype: float64

In [13]:
#calculate the survival ratio of the passengers

#number of passengers who survived / total number of passengers

newdf['survived'].sum()/len(newdf['survived'])

0.3838383838383838

In [14]:
#HW:

#Calculate the survival ratio of the passengers <= 25 years

In [15]:
l1 = [1,2,3,4,5]

len(l1)

5

In [ ]:
#Solution:

newdf25 = newdf[newdf['age'] <= 25] # slicing

# Number of people who survived with age < 25 / Total number of passengers
newdf25['survived'].sum() / len(newdf['survived'])